var alphabet = {
    " ":"   ",
    "A":".-",
    "B":"-...",
    "C":"-.-.",
    "D":"-..",
    "E":".",
    "F":"..-.",
    "G":"--.",
    "H":"....",
    "I":"..",
    "J":".---",
    "K":"-.-",
    "L":".-..",
    "M":"--",
    "N":"-.",
    "O":"---",
    "P":".--.",
    "Q":"--.-",
    "R":".-.",
    "S":"...",
    "T":"-",
    "U":"..-",
    "V":"...-",
    "W":".--",
    "X":"-..-",
    "Y":"-.--",
    "Z":"--..",
//Numbers
    "0":"-----",
    "1":".----",
    "2":"..---",
    "3":"...--",
    "4":"....-",
    "5":".....",
    "6":"-....",
    "7":"--...",
    "8":"---..",
    "9":"---.",
//Punctuation marks
    "!":"-.-.--",
    "@":".--.-.",
    ".":".-.-.-",
    ",":"--..--",
    "?":"..--..",
    "/":"-..-.",
//Non English letters
    "Ä":".-.-",
    "Æ":".-.-",
    "Ą":".-.-",
    "À":".--.-",
    "Å":".--.-",
    "Ç":"-.-..",
    "Ĉ":"-.-..",
    "Ć":"-.-..",
    "CH":"----",
    "Š":"----",
    "Ð":"..--.",
    "ETH":"..--.",
    "Ś":"...-...",
    "È":".-..-",
    "Ł":".-..-",
    "É":"..-..",
    "Đ":"..-..",
    "Ę":"..-..",
    "Ĝ":"--.-.",
    "Ĥ":"----",
    "Ĵ":".---.",
    "Ź":"--..-.",
    "Ñ":"--.--",
    "Ń":"--.--",
    "Ö":"---.",
    "Ø":"---.",
    "Ó":"---.",
    "Ŝ":"...-.",
    "Þ":".--..",
    "Ü":"..--",
    "Ŭ":"..--",
    "Ż":"--..-"
};

function charToMorse ( char ) {
    return alphabet[char.charAt(0).toUpperCase()] || char;
}

function beautify (morseStr) {
    var ret = '';
    for (var i = 0; i < morseStr.length; i++ ) {
        var ch = morseStr[i];
        if ( ch === '.' ) {
            ret += '·';
        } else if ( ch === '-' ) {
            ret += '–';
        } else if ( ch === ' ' ) {
            ret += '  ';
        } else {
            ret += ch;
        }
        ret += ' ';
    }
    return ret;
}

function strToMorse ( str ) {
    if ( typeof str !== 'string' ) {
        return "* not a string";
    }
    var ret = '';
    for ( var i = 0; i < str.length; i++ ) {
        ret += charToMorse(str.charAt(i)) + ' ';
    }
    return beautify(ret);
}